pruebas/results/2025-11-11_00-34-50/S5_1_proxy_ro_fail_t1.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 1 tps: 167.14 qps: 2675.30 (r/w/o: 2340.81/0.00/334.49) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 1 tps: 168.40 qps: 2696.25 (r/w/o: 2359.44/0.00/336.81) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 1 tps: 170.21 qps: 2723.32 (r/w/o: 2382.90/0.00/340.41) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1 tps: 174.18 qps: 2785.14 (r/w/o: 2436.77/0.00/348.37) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 1 tps: 160.80 qps: 2574.64 (r/w/o: 2253.03/0.00/321.60) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 1 tps: 154.39 qps: 2469.66 (r/w/o: 2160.87/0.00/308.78) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 1 tps: 156.82 qps: 2509.37 (r/w/o: 2195.72/0.00/313.65) lat (ms,95%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 1 tps: 148.35 qps: 2373.59 (r/w/o: 2076.89/0.00/296.70) lat (ms,95%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 1 tps: 162.86 qps: 2605.69 (r/w/o: 2279.98/0.00/325.71) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 1 tps: 176.53 qps: 2822.54 (r/w/o: 2469.47/0.00/353.07) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 1 tps: 177.25 qps: 2835.86 (r/w/o: 2481.35/0.00/354.51) lat (ms,95%): 6.91 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 1 tps: 177.60 qps: 2844.04 (r/w/o: 2488.83/0.00/355.20) lat (ms,95%): 6.79 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            139636
        write:                           0
        other:                           19948
        total:                           159584
    transactions:                        9974   (166.22 per sec.)
    queries:                             159584 (2659.51 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0039s
    total number of events:              9974

Latency (ms):
         min:                                    4.36
         avg:                                    6.01
         max:                                   43.21
         95th percentile:                        7.98
         sum:                                59969.60

Threads fairness:
    events (avg/stddev):           9974.0000/0.00
    execution time (avg/stddev):   59.9696/0.00