pruebas/results/2025-11-11_00-34-50/S5_1_proxy_ro_fail_t4.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 4 tps: 656.96 qps: 10514.59 (r/w/o: 9199.86/0.00/1314.72) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 4 tps: 631.03 qps: 10097.93 (r/w/o: 8835.86/0.00/1262.07) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 4 tps: 614.01 qps: 9827.14 (r/w/o: 8599.12/0.00/1228.02) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 574.99 qps: 9198.12 (r/w/o: 8048.13/0.00/1149.99) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 4 tps: 586.20 qps: 9381.63 (r/w/o: 8209.22/0.00/1172.40) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 615.39 qps: 9843.64 (r/w/o: 8612.86/0.00/1230.78) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 4 tps: 618.42 qps: 9896.08 (r/w/o: 8659.24/0.00/1236.83) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 631.97 qps: 10109.16 (r/w/o: 8845.21/0.00/1263.94) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 4 tps: 602.99 qps: 9651.25 (r/w/o: 8445.27/0.00/1205.98) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 621.44 qps: 9943.21 (r/w/o: 8700.34/0.00/1242.88) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 4 tps: 588.41 qps: 9411.77 (r/w/o: 8234.94/0.00/1176.82) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 562.78 qps: 9004.14 (r/w/o: 7878.77/0.00/1125.37) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            511378
        write:                           0
        other:                           73054
        total:                           584432
    transactions:                        36527  (608.70 per sec.)
    queries:                             584432 (9739.21 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0071s
    total number of events:              36527

Latency (ms):
         min:                                    4.52
         avg:                                    6.57
         max:                                   57.25
         95th percentile:                        8.13
         sum:                               239909.07

Threads fairness:
    events (avg/stddev):           9131.7500/469.41
    execution time (avg/stddev):   59.9773/0.00