pruebas/results/2025-11-11_00-34-50/S5_1_proxy_ro_fail_t8.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 636.40 qps: 10193.79 (r/w/o: 8919.39/0.00/1274.40) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 755.22 qps: 12086.76 (r/w/o: 10576.32/0.00/1510.45) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 846.18 qps: 13536.02 (r/w/o: 11843.67/0.00/1692.35) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 885.62 qps: 14176.31 (r/w/o: 12405.07/0.00/1771.24) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 899.18 qps: 14378.96 (r/w/o: 12580.79/0.00/1798.17) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 903.61 qps: 14462.20 (r/w/o: 12654.78/0.00/1807.43) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 777.60 qps: 12440.39 (r/w/o: 10885.39/0.00/1555.00) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 807.98 qps: 12929.49 (r/w/o: 11313.33/0.00/1616.16) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 820.02 qps: 13116.40 (r/w/o: 11476.55/0.00/1639.85) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 795.59 qps: 12731.72 (r/w/o: 11140.53/0.00/1591.19) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 693.20 qps: 11084.63 (r/w/o: 9698.02/0.00/1386.60) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 656.01 qps: 10500.52 (r/w/o: 9188.71/0.00/1311.82) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            663474
        write:                           0
        other:                           94782
        total:                           758256
    transactions:                        47391  (789.69 per sec.)
    queries:                             758256 (12635.12 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0106s
    total number of events:              47391

Latency (ms):
         min:                                    4.90
         avg:                                   10.13
         max:                                   61.14
         95th percentile:                       17.32
         sum:                               479894.37

Threads fairness:
    events (avg/stddev):           5923.8750/786.67
    execution time (avg/stddev):   59.9868/0.00